Revit 2026 API

# FilteredElementCollectorIsViewValidForElementIteration Method

---

Identifies if the particular element is valid for iteration of drawn elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsViewValidForElementIteration(
	Document document,
	ElementId viewId
)
```
```vb
Public Shared Function IsViewValidForElementIteration (
	document As Document,
	viewId As ElementId
) As Boolean
```
```cpp
public:
static bool IsViewValidForElementIteration(
	Document^ document,
	ElementId^ viewId
)
```
```fsharp
static member IsViewValidForElementIteration :
        document : Document *
        viewId : ElementId -> bool
```

#### Parameters

document Document
     The document.
viewId ElementId
     The view id.

#### Return Value

Boolean True if the element is valid for iteration.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Views that have no way of representing drawn elements, such as many view templates, fail this check.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace